; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared1 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	Star2 - direction
	Star5 - direction
	Star4 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 spectrograph3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite2 Star4)
	(have_image Planet8 infrared1)
	(have_image Star9 spectrograph3)
	(have_image Star10 infrared1)
	(have_image Star11 spectrograph2)
	(have_image Star12 infrared1)
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 star11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star11)
   goals met: 0 of 9
5. (take_image satellite1 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon14 instrument2 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
9. (turn_to satellite0 star4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star4)
   goals met: 2 of 9
10. (take_image satellite1 phenomenon13 instrument2 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 3 of 9
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 9
12. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 9
13. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 3 of 9
14. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 4 of 9
15. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 4 of 9
16. (take_image satellite0 star10 instrument0 infrared1)
   added: (have_image star10 infrared1)
   goals met: 5 of 9
17. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 9
18. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 6 of 9
19. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 6 of 9
20. (take_image satellite0 star9 instrument0 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 7 of 9
21. (turn_to satellite1 star15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star15)
   goals met: 7 of 9
22. (take_image satellite1 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 8 of 9
23. (turn_to satellite2 star4 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star4)
   goals met: 9 of 9
